import html
import re

from typing import Dict, List, Any

# fileDic = {1:'K0.txt', 2:'K10.txt', 3:'K11.txt', 4:'K12.txt', 5:'K121.txt',
#            6:'K122.txt', 7:'K123.txt', 8:'K21.txt', 9:'K211.txt', 10:'K212.txt',
#            11:'K22.txt', 12:'K23.txt', 13:'K30.txt', 14:'K31.txt', 15:'K32.txt',
#            16:'K41.txt', 17:'K42.txt', 18:'K43.txt', 19:'K44.txt', 20:'K51.txt',
#            21:'K52.txt', 22:'K61.txt', 23:'K62.txt', 24:'K71.txt', 25:'K72.txt',
#            26:'KOrikomi.txt', 27:'KFront.txt'}

option_dict = {
    1: {'使': [[1], []]},
    3: {'道': [[1, 2, 5, 11],
              ['道で', '道じゅん', 'この道', 'ある道',
               '道を', '道は', '道だ', 'は道', '歩道', '国道',
               '道の近くは', '旧道']],
        '橋': [[1], ['鉄橋', '橋を']],
        '駅': [[1, 2], ['駅の']],
        '他': [[1], ['他にも']],
        '決': [[1], ['決めて']],
        '物': [[1], []],
        '乗': [[1], ['乗用車']],
        '畑': [[1], []],
        '両': [[1], []],
        '使': [[1,2], []],
        '館': [[1], []],
        '持': [[1], []],
        '大堀川': [[1], []],
        '整理': [[1, 2], []],
        '銀行': [[1, 2], []],
        '工': [[1,3], []],
        '屋上': [[1], []]
        },
    5: {'利根川': [[1], []],
        '公共': [[1], []]},
    9: {'物': [[1,2,6], ['品物']],
        '品物': [[1,2,3], []]},
    10: {'物': [[1,2,6], ['品物']],
        '品物': [[1,2,3], []]},
    20: {
        '井': [[2, 3, 4], ['井戸']],
        '沼': [[], ['沼南']]},
    23: {'害': [[4], ['風水害','水害']],
        '自然': [[1], []]
         },
    24: {'江戸':[[1],[]]}
}

#   処理ファイル毎に「option_dict」から作成する。
do_dict = {
    '道': {'num': 0,
          'position': [1, 2, 5]},
    '橋': {'num': 0,
          'position': [1],
          },
    '決': {'num': 0,
          'position': [1],
          }
}

# rubyDict_11: {
#     'file' : 'Kashiwa_1-1',
#     'rubi' : {'発見':'はっけん', '登下校':'とうげこう', '他':'ほか',
#               '集':'あつ', '使':'つか', '決':'き', '八方位':'はちほうい',
#               '駅':'えき', '物':'もの', '調':'しら', '整理':'せいり',
#               '礼':'れい', '道':'どう', '銀行':'ぎんこう',
#               '東葛飾':'ひがしかつしか', '橋':'きょう', '両':'りょう',
#               '自動車販売店':'じどうしゃはんばいてん',
#               '乗用車':'じょうようしゃ', '大堀川':'おおほりがわ',
#               '向':'むか', '急':'きゅう', '坂':'さか', '畑':'はたけ',
#               '流':'なが', '旧水戸':'きゅうみと', '館':'かん',
#               '教育福祉':'きょういくふくし', '感想':'かんそう',
#               '方位記号':'ほういきごう', '意味':'いみ', '持':'も',
#               '工':'く', '屋上':'おくじょう'  },
#     'strict':  {'道':[[1, 2, 5],
#                      ['道で', '道じゅん','この道','ある道',
#                       '道を','道は','道だ', 'は道', '歩道','国道']],
#                 '橋':[[1],['鉄橋','橋を']]}
#                }

# Watashitachino_Kashiwa_1-1.html ;
