import html
import re

from typing import Dict, List, Any

option_dict = {
    1: {'使': [[1], []]},
    3: {'道': [[1, 2, 5, 11],
              ['道で', '道じゅん', 'この道', 'ある道',
               '道を', '道は', '道だ', 'は道', '歩道', '国道',
               '道の近くは', '旧道']],
        '橋': [[1], ['鉄橋', '橋を']],
        '駅': [[1, 2], ['駅の']],
        '他': [[1], ['他にも']],
        '決': [[1], ['決めて']],
        '物': [[1], []],
        '畑': [[1], []],
        '両': [[1], []],
        '使': [[1], []],
        '館': [[1], []],
        '持': [[1], []],
        '大堀川': [[1], []],
        '整理': [[1, 2], []],
        '銀行': [[1, 2], []],
        '工': [[3], []],
        '屋上': [[1], []]
        },
    5: {'利根川': [[1], []],
        '公共': [[1], []]}
}

#   処理ファイル毎に「option_dict」から作成する。
do_dict = {
    '道': {'num': 0,
          'position': [1, 2, 5]},
    '橋': {'num': 0,
          'position': [1],
          },
    '決': {'num': 0,
          'position': [1],
          }
}

# rubyDict_11: {
#     'file' : 'Kashiwa_1-1',
#     'rubi' : {'発見':'はっけん', '登下校':'とうげこう', '他':'ほか',
#               '集':'あつ', '使':'つか', '決':'き', '八方位':'はちほうい',
#               '駅':'えき', '物':'もの', '調':'しら', '整理':'せいり',
#               '礼':'れい', '道':'どう', '銀行':'ぎんこう',
#               '東葛飾':'ひがしかつしか', '橋':'きょう', '両':'りょう',
#               '自動車販売店':'じどうしゃはんばいてん',
#               '乗用車':'じょうようしゃ', '大堀川':'おおほりがわ',
#               '向':'むか', '急':'きゅう', '坂':'さか', '畑':'はたけ',
#               '流':'なが', '旧水戸':'きゅうみと', '館':'かん',
#               '教育福祉':'きょういくふくし', '感想':'かんそう',
#               '方位記号':'ほういきごう', '意味':'いみ', '持':'も',
#               '工':'く', '屋上':'おくじょう'  },
#     'strict':  {'道':[[1, 2, 5],
#                      ['道で', '道じゅん','この道','ある道',
#                       '道を','道は','道だ', 'は道', '歩道','国道']],
#                 '橋':[[1],['鉄橋','橋を']]}
#                }

# Watashitachino_Kashiwa_1-1.html ;
