import html
import re

WK11 = {
    '発見': {'kana': 'はっけん'},
    '登下校': {'kana': 'とうげこう'},
    '他': {'kana': 'はっけん'},
    '使': {'kana': 'つか'},
    '決': {'kana': 'き'},
    '八方位': {'kana': 'はちほうい'},
    '駅': {'kana': 'えき',
          'pos': [1, 2],
          'neg': ['駅の']},
    '物': {'kana': 'もの'},
    '調': {'kana': 'しら'},
    '整理': {'kana': 'せいり'},
    '礼': {'kana': 'れい'},
    '道': {'kana': 'どう',
          'pos': [1, 2, 5],
          'neg': ['道で', '道じゅん', 'この道', 'ある道',
                  '道を', '道は', '道だ', 'は道', '歩道', '国道']
          },
    '銀行': {'kana': 'ぎんこう'},
    '東葛飾': {'kana': 'ひがしかつしか'},
    '橋': {'kana': 'きょう',
          'pos': [1],
          'neg': ['鉄橋', '橋を']},
    '両': {'kana': 'りょう'},
    '自動車販売店': {'kana': 'じどうしゃはんばいてん'},
    '乗用車': {'kana': 'じょうようしゃ'},
    '大堀川': {'kana': 'おおほりがわ'},
    '向': {'kana': 'むか'},
    '急': {'kana': 'きゅう'},
    '坂': {'kana': 'さか'},
    '畑': {'kana': 'はたけ'},
    '流': {'kana': 'なが'},
    '旧水戸': {'kana': 'きゅうみと'},
    '館': {'kana': 'かん'},
    '教育福祉': {'kana': 'きょういくふくし'},
    '感想': {'kana': 'かんそう'},
    '方位記号': {'kana': 'ほういきごう'},
    '意味': {'kana': 'いみ'},
    '持': {'kana': 'も'},
    '工': {'kana': 'く'},
    '屋上': {'kana': 'おくじょう'}
}
option_dict = {
    3: {'道': [[1, 2, 5],
              ['道で', '道じゅん', 'この道', 'ある道',
               '道を', '道は', '道だ', 'は道', '歩道', '国道']],
        '橋': [[1], ['鉄橋', '橋を']],
        '駅': [[1, 2], ['駅の']]}
}

#   処理ファイル毎に「option_dict」から作成する。
do_dict = {
    '道': {'num': 0,
          'position': [1, 2, 5]},
    '橋': {'num': 0,
          'position': [1]}
}
